In [1]:
# Importing pandas and numpy libraries
import pandas as pd
import numpy as np

# Defining lists
row1 = list([1001.0, 'Pandas Banking', 235000, 248000, 5.5, 2013,3,10, 0])
row2 = list([1002.0, 'Pandas Grocery', 196000, 205000, 4.5, 2016,4,30, 0])
row3 = list([1003.0, 'Pandas Telecom', 167000, 193000, 15.5, 2010,11,24, 0])
row4 = list([1004.0, 'Pandas Transport', 79000, 90000, 13.9, 2018,1,15, 1])
row5 = list([1005.0, 'Pandas Insurance', 241000, 264000, 9.5, 2009,6,1, 0])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5])

# Display DataFrame values
data_frame

In [4]:
# Display DataFrame info
data_frame.info()

In [5]:
# Convert column 0 into a int
data_frame[0] = data_frame[0].astype('int')
data_frame[0]

,0,1,2,3
0,Vernia Anthony,"1051 Balceta Square, Reedley, Michigan",Vernia Anthony,"1051 Balceta Square, Reedley, Michigan"
1,Daren Underwood,"982 Duboce Gardens, Peachtree City, Georgia",Daren Underwood,"982 Duboce Gardens, Peachtree City, Georgia"
2,Stanley Marks,"541 Merrill Stravenue, Talladega, Pennsylvania",Stanley Marks,"541 Merrill Stravenue, Talladega, Pennsylvania"
3,Shad Ruiz,"1018 Whiting Line, North Platte, New Jersey",Shad Ruiz,"1018 Whiting Line, North Platte, New Jersey"
4,Danny Mooney,"1301 Grand View Crescent, Oviedo, Washington",Danny Mooney,"1301 Grand View Crescent, Oviedo, Washington"

In [6]:
# Summing column 2 and column 3 together
data_frame[2] + data_frame[3]

,full_name,address,full_name,address
0,Vernia Anthony,"1051 Balceta Square, Reedley, Michigan",Vernia Anthony,"1051 Balceta Square, Reedley, Michigan"
1,Daren Underwood,"982 Duboce Gardens, Peachtree City, Georgia",Daren Underwood,"982 Duboce Gardens, Peachtree City, Georgia"
2,Stanley Marks,"541 Merrill Stravenue, Talladega, Pennsylvania",Stanley Marks,"541 Merrill Stravenue, Talladega, Pennsylvania"
3,Shad Ruiz,"1018 Whiting Line, North Platte, New Jersey",Shad Ruiz,"1018 Whiting Line, North Platte, New Jersey"
4,Danny Mooney,"1301 Grand View Crescent, Oviedo, Washington",Danny Mooney,"1301 Grand View Crescent, Oviedo, Washington"
5,Jacqui Barron,"272 Boardman Row, Manteca, Hawaii",Jacqui Barron,"272 Boardman Row, Manteca, Hawaii"
6,Elijah Casey,"387 Hubbell Green, Springfield, Utah",Elijah Casey,"387 Hubbell Green, Springfield, Utah"
7,Jutta Gill,"632 Tulip Plaza, Newport Beach, Maine",Jutta Gill,"632 Tulip Plaza, Newport Beach, Maine"
8,Riva Foley,"497 Coleridge Route, Schererville, Iowa",Riva Foley,"497 Coleridge Route, Schererville, Iowa"
9,Jutta Woodard,"129 Ora Point, Wheat Ridge, Alabama",Jutta Woodard,"129 Ora Point, Wheat Ridge, Alabama"
10,Fleta Walton,"1026 Brook Gardens, Murrieta, Colorado",Fleta Walton,"1026 Brook Gardens, Murrieta, Colorado"
11,Stanley Calhoun,"804 Glover Crescent, Chattanooga, Hawaii",Stanley Calhoun,"804 Glover Crescent, Chattanooga, Hawaii"
12,Dimple Head,"1338 Halyburton Thruway, Bentonville, Massachu...",Dimple Head,"1338 Halyburton Thruway, Bentonville, Massachu..."
13,Rossana Horton,"1269 Hunt Pike, Dania Beach, Wisconsin",Rossana Horton,"1269 Hunt Pike, Dania Beach, Wisconsin"
14,Jeffrey Collier,"544 Havens Walk, Indianapolis, Rhode Island",Jeffrey Collier,"544 Havens Walk, Indianapolis, Rhode Island"
15,Stephan Bray,"698 Ina Annex, Ridgecrest, Kentucky",Stephan Bray,"698 Ina Annex, Ridgecrest, Kentucky"
16,Aleen Whitfield,"1159 Ohlone Line, South Euclid, Missouri",Aleen Whitfield,"1159 Ohlone Line, South Euclid, Missouri"
17,Arlie Fitzgerald,"1030 Elgin Private, Huber Heights, North Dakota",Arlie Fitzgerald,"1030 Elgin Private, Huber Heights, North Dakota"
18,Darrin Mathis,"218 Graham Private, Chino, Idaho",Darrin Mathis,"218 Graham Private, Chino, Idaho"
19,Lane Mooney,"1195 Saint Croix Cove, Irving, Texas",Lane Mooney,"1195 Saint Croix Cove, Irving, Texas"
20,Christoper Stephens,"873 Standish Mall, Belle Glade, Iowa",Christoper Stephens,"873 Standish Mall, Belle Glade, Iowa"
21,Alden Clarke,"849 Loma Vista Route, Sherman, North Dakota",Alden Clarke,"849 Loma Vista Route, Sherman, North Dakota"
22,Fred Olson,"1180 Farview Expressway, Dalton, Kentucky",Fred Olson,"1180 Farview Expressway, Dalton, Kentucky"
23,August Phelps,"602 Cuba Wynd, Ontario, Pennsylvania",August Phelps,"602 Cuba Wynd, Ontario, Pennsylvania"
24,Perry Dickerson,"920 Shields Glen, Southaven, Alabama",Perry Dickerson,"920 Shields Glen, Southaven, Alabama"
25,Elvin Mccormick,"146 Taylor Townline, Ankeny, Georgia",Elvin Mccormick,"146 Taylor Townline, Ankeny, Georgia"
26,Glennis Ballard,"863 Geary Side road, Saratoga Springs, Alabama",Glennis Ballard,"863 Geary Side road, Saratoga Springs, Alabama"
27,Bulah Fry,"286 Page Field, Pompano Beach, Massachusetts",Bulah Fry,"286 Page Field, Pompano Beach, Massachusetts"
28,Moshe Koch,"1037 Storey Terrace, Wauwatosa, Oklahoma",Moshe Koch,"1037 Storey Terrace, Wauwatosa, Oklahoma"
29,Jonelle Newman,"384 Samoset Concession road, Hickory, Florida",Jonelle Newman,"384 Samoset Concession road, Hickory, Florida"
30,Wyatt Spears,"113 Escondido Mall, Skokie, California",Wyatt Spears,"113 Escondido Mall, Skokie, California"
31,Lawerence Hays,"1341 Fairbanks Expressway, Monroeville, West V...",Lawerence Hays,"1341 Fairbanks Expressway, Monroeville, West V..."
32,Maurice Burnett,"484 Candlestick Cove Drung, Converse, Oklahoma",Maurice Burnett,"484 Candlestick Cove Drung, Converse, Oklahoma"
33,Aleshia Morton,"850 Lagunitas Mews, Beverly Hills, North Dakota",Aleshia Morton,"850 Lagunitas Mews, Beverly Hills, North Dakota"
34,Logan Stephenson,"705 Barry Plaza, Madison Heights, Vermont",Logan Stephenson,"705 Barry Plaza, Madison Heights, Vermont"
35,Rob Grimes,"1126 Battery Field, Laramie, New Hampshire",Rob Grimes,"1126 Battery Field, Laramie, New Hampshire"
36,Dominica Spencer,"351 Hicks Path, Stockton, Colorado",Dominica Spencer,"351 Hicks Path, Stockton, Colorado"
37,Kera Underwood,"551 Divisadero Street, Claremont, Hawaii",Kera Underwood,"551 Divisadero Street, Claremont, Hawaii"
38,Kallie Love,"233 Calgary Spur, Gresham, North Carolina",Kallie Love,"233 Calgary Spur, Gresham, North Carolina"
39,Jimmie Mooney,"209 Lake Forest Expressway, Brawley, Arkansas",Jimmie Mooney,"209 Lake Forest Expressway, Brawley, Arkansas"
40,Josef Stephenson,"770 Roselyn Path, Coronado, Nevada",Josef Stephenson,"770 Roselyn Path, Coronado, Nevada"
41,Amos Page,"537 Ortega Concession road, Pelham, Alabama",Amos Page,"537 Ortega Concession road, Pelham, Alabama"
42,Weldon Rocha,"1090 Transbay Loop Street, North Chicago, Arizona",Weldon Rocha,"1090 Transbay Loop Street, North Chicago, Arizona"
43,Raul Wilkinson,"638 Marlin Point, Macon, Michigan",Raul Wilkinson,"638 Marlin Point, Macon, Michigan"
44,Eugene Rocha,"1394 Sawyer Road, Geneva, Hawaii",Eugene Rocha,"1394 Sawyer Road, Geneva, Hawaii"
45,Augustus Conley,"421 Powhattan Sideline, Caldwell, Mississippi",Augustus Conley,"421 Powhattan Sideline, Caldwell, Mississippi"
46,Lyndia Humphrey,"323 Lori Plantation, Vernon Hills, Oregon",Lyndia Humphrey,"323 Lori Plantation, Vernon Hills, Oregon"
47,Vito Cochran,"136 Dr Tom Waddell Bypass, Pembroke Pines, New...",Vito Cochran,"136 Dr Tom Waddell Bypass, Pembroke Pines, New..."
48,Preston Randall,"1178 Burke Boulevard, Sugar Land, Oklahoma",Preston Randall,"1178 Burke Boulevard, Sugar Land, Oklahoma"
49,Derrick Holman,"401 Cayuga Viaduct, Pittsburg, Indiana",Derrick Holman,"401 Cayuga Viaduct, Pittsburg, Indiana"

In [6]:
# Create list of column headers
column_names = ["Customer ID", "Customer Name", "2018 Revenue", "2019 Revenue", "Growth", "Start Year", "Start Month", "Start Day", "New Customer"]
column_names

['Customer ID',
 'Customer Name',
 '2018 Revenue',
 '2019 Revenue',
 'Growth',
 'Start Year',
 'Start Month',
 'Start Day',
 'New Customer']

In [7]:
# Replace missing column headers
data_frame.columns = column_names
data_frame

,Customer ID,Customer Name,2018 Revenue,2019 Revenue,Growth,Start Year,Start Month,Start Day,New Customer
0,1001,Pandas Banking,235000,248000,5.5,2013,3,10,0
1,1002,Pandas Grocery,196000,205000,4.5,2016,4,30,0
2,1003,Pandas Telecom,167000,193000,15.5,2010,11,24,0
3,1004,Pandas Transport,79000,90000,13.9,2018,1,15,1
4,1005,Pandas Insurance,241000,264000,9.5,2009,6,1,0

In [8]:
#Define the csv URL
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Pandas-Workshop/master/Chapter06/Data/retail_purchase_missing_headers.csv'

# Import the csv as a DataFrame
data_frame = pd.read_csv(file_url)

#Display the DataFrame
data_frame

    10001  24/05/20        Wheat  4.8lb  €17       Fline Store
0   10002  05/05/20  Fruit Juice  3.1lb  €19  Dello Superstore
1   10003  27/04/20   Vegetables  1.2lb  €15     Javies Retail
2   10004  05/05/20          Oil  3.1lb  €17     Javies Retail
3   10005  27/04/20        Wheat  4.8lb  €13     Javies Retail
4   10006  14/01/20       Butter  3.6lb  €27   Oldi Superstore
5   10007  20/04/20          Oil  4.8lb  €21  Dello Superstore
6   10008  05/05/20        Wheat  3.6lb  €25   Oldi Superstore
7   10009  17/04/20       Fruits  1.2lb  €24   Oldi Superstore
8   10010  15/06/20          Oil  4.4lb  €25       Kanes Store
9   10011  17/06/20          Oil  4.4lb  €16       Fline Store
10  10012  11/06/20       Cheese  2.3lb  €20       Fline Store
11  10013  19/03/20         Rice  4.4lb  €27       Kanes Store
12  10014  01/01/20       Cheese  1.2lb  €10       Fline Store
13  10015  07/07/20  Fruit Juice  3.6lb  €27   Oldi Superstore

In [9]:
# Import the csv as a DataFrame
data_frame = pd.read_csv(file_url, header=None)

#Display the DataFrame
data_frame

        0         1            2      3    4                 5
0   10001  24/05/20        Wheat  4.8lb  €17       Fline Store
1   10002  05/05/20  Fruit Juice  3.1lb  €19  Dello Superstore
2   10003  27/04/20   Vegetables  1.2lb  €15     Javies Retail
3   10004  05/05/20          Oil  3.1lb  €17     Javies Retail
4   10005  27/04/20        Wheat  4.8lb  €13     Javies Retail
5   10006  14/01/20       Butter  3.6lb  €27   Oldi Superstore
6   10007  20/04/20          Oil  4.8lb  €21  Dello Superstore
7   10008  05/05/20        Wheat  3.6lb  €25   Oldi Superstore
8   10009  17/04/20       Fruits  1.2lb  €24   Oldi Superstore
9   10010  15/06/20          Oil  4.4lb  €25       Kanes Store
10  10011  17/06/20          Oil  4.4lb  €16       Fline Store
11  10012  11/06/20       Cheese  2.3lb  €20       Fline Store
12  10013  19/03/20         Rice  4.4lb  €27       Kanes Store
13  10014  01/01/20       Cheese  1.2lb  €10       Fline Store
14  10015  07/07/20  Fruit Juice  3.6lb  €27   Oldi Superstore

In [10]:
# Create list of column headers
column_names = ["Receipt Id", "Date of Purchase", "Product Name", "Product Weight", "Total Price", "Retail shop name"]

# Replace missing column headers
data_frame.columns = column_names
data_frame

,Receipt Id,Date of Purchase,Product Name,Product Weight,Total Price,Retail shop name
0,10001,24/05/20,Wheat,4.8lb,€17,Fline Store
1,10002,05/05/20,Fruit Juice,3.1lb,€19,Dello Superstore
2,10003,27/04/20,Vegetables,1.2lb,€15,Javies Retail
3,10004,05/05/20,Oil,3.1lb,€17,Javies Retail
4,10005,27/04/20,Wheat,4.8lb,€13,Javies Retail
5,10006,14/01/20,Butter,3.6lb,€27,Oldi Superstore
6,10007,20/04/20,Oil,4.8lb,€21,Dello Superstore
7,10008,05/05/20,Wheat,3.6lb,€25,Oldi Superstore
8,10009,17/04/20,Fruits,1.2lb,€24,Oldi Superstore
9,10010,15/06/20,Oil,4.4lb,€25,Kanes Store
10,10011,17/06/20,Oil,4.4lb,€16,Fline Store
11,10012,11/06/20,Cheese,2.3lb,€20,Fline Store
12,10013,19/03/20,Rice,4.4lb,€27,Kanes Store
13,10014,01/01/20,Cheese,1.2lb,€10,Fline Store
14,10015,07/07/20,Fruit Juice,3.6lb,€27,Oldi Superstore

In [11]:
!pip install mimesis

Requirement already satisfied: mimesis in /Users/williamso/.local/share/virtualenvs/git-2T0aQk80/lib/python3.7/site-packages (4.1.2)

In [12]:
from mimesis import Person
from mimesis import Address
from mimesis.enums import Gender
from mimesis import Datetime
person = Person('en')
import pandas as pd
import random
person = Person()
addess = Address()
datetime = Datetime()
def create_rows_mimesis(num=1):
    output = [{"full_name":person.full_name(),
                   "address":addess.address() + ', '+ addess.city() + ', '+ addess.state(),
                   #"name":person.name() + ' ' + person.name(),
                   #"email":person.email(),
                   "creation_date_time":datetime.datetime()
                   #"paragraph":person.paragraph(),
                   #"Conrad":person.catch_phrase(),
                   #"randomdata":random.randint(1000,2000)
              } for x in range(num)
             ]
    return output

df_mimesis = pd.DataFrame(create_rows_mimesis(10))

In [13]:
df_mimesis

,full_name,address,creation_date_time
0,Jay Barnett,"444 Grijalva Nene, Golden, Kentucky",2019-11-13 19:14:32.000137
1,Courtney Luna,"260 Bay Highway, Hialeah Gardens, Mississippi",2009-12-03 09:21:34.905300
2,Lanelle Weiss,"98 Kobbe Court, Gainesville, Mississippi",2015-07-08 20:02:04.699107
3,Aiko Martin,"301 Alta Mar Walk, Kingsport, Ohio",2009-01-15 10:14:40.321837
4,Larita Coffey,"524 Plum Loop, St. Louis Park, Wyoming",2004-03-29 01:36:44.615096
5,Stasia Trevino,"1333 Oak Park Manor, Cupertino, Tennessee",2001-03-11 19:41:44.353350
6,Julio Blevins,"136 Sutro Heights Terrace, Loves Park, Virginia",2008-05-12 10:30:13.113559
7,Lamont Riggs,"726 Peters Circle, Cortland, Maine",2009-03-21 16:55:36.518095
8,Lahoma Mcdowell,"11 Rosewood Concession road, Adrian, Virginia",2014-11-25 03:49:46.894824
9,Efren Benson,"691 Dartmouth Trail, West Allis, Pennsylvania",2017-10-14 20:19:24.005478

In [42]:
df_mimesis.to_csv(r'dataframe.csv', index = False, header=True)

In [14]:
#Define the csv URL
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Pandas-Workshop/master/Chapter06/Data/adresses.csv'

# Import the csv as a DataFrame
data_frame = pd.read_csv(file_url)

#Display the DataFrame
data_frame

,full_name,address,creation_date_time
0,Regena Phillips,"1252 Ord Townline, Pampa, New Hampshire",2018-02-08 22:32:23.172602
1,Rolande Bowen,"1091 Santa Barbara Line, Fullerton, Georgia",2015-05-29 23:01:58.196541
2,Josiah Spencer,"1268 Burgoyne Promenade, San Leandro, Florida",2013-08-23 09:41:48.824323
3,Latoyia Watts,"352 Dearborn Gate, Norman, New York",2004-05-29 02:07:28.531585
4,Maddie Blair,"1110 London Line, Flagstaff, North Dakota",2020-05-18 15:23:12.243274
5,Pasquale Cooper,"1313 Silverview Stravenue, Kenner, North Carolina",2006-04-12 11:47:38.053828
6,Giuseppe Wood,"738 Opalo Circle, Brooklyn Center, Kansas",2001-03-20 17:14:45.150522
7,Lindsey Garza,"747 Desmond Nene, Olive Branch, Wisconsin",2008-04-24 19:42:11.206692
8,Randy Mcpherson,"171 Byron Street, Pleasanton, Vermont",2010-06-21 22:52:23.019956
9,Cristobal Walsh,"55 Crestwell Square, Oxford, Alaska",2014-12-13 09:47:34.974209

In [15]:
# Defining columns
column_names = ['full_name', 'address', 'creation_date_time']

# Defining lists
row1 = list(['Pasquale Cooper', '1268 Burgoyne Promenade, San Leandro, Florida', '2004-05-29 02:07:28'])
row2 = list(['Giuseppe Wood', '738 Opalo Circle, Brooklyn Center, Kansas', '2008-04-24 19:42:11'])
row3 = list(['Lindsey Garza', '747 Desmond Nene, Olive Branch, Wisconsin', '2013-08-23 09:41:48'])
row4 = list(['Randy Mcpherson', '171 Byron Street, Pleasanton, Vermont', '2010-06-21 22:52:23'])
row5 = list(['Cristobal Walsh', '55 Crestwell Square, Oxford, Alaska', '2014-12-13 09:47:34'])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5], columns=column_names)

# Display DataFrame values
data_frame

,full_name,address,creation_date_time
0,Pasquale Cooper,"1268 Burgoyne Promenade, San Leandro, Florida",2004-05-29 02:07:28
1,Giuseppe Wood,"738 Opalo Circle, Brooklyn Center, Kansas",2008-04-24 19:42:11
2,Lindsey Garza,"747 Desmond Nene, Olive Branch, Wisconsin",2013-08-23 09:41:48
3,Randy Mcpherson,"171 Byron Street, Pleasanton, Vermont",2010-06-21 22:52:23
4,Cristobal Walsh,"55 Crestwell Square, Oxford, Alaska",2014-12-13 09:47:34

In [17]:
# Split the column into 2 new columns
data_frame[['first_name','last_name']] = data_frame.full_name.str.split(expand=True)
data_frame

In [19]:
# Delete the column
data_frame.drop('full_name', axis=1, inplace=True)
data_frame

,address,creation_date_time,first_name,last_name
0,"1268 Burgoyne Promenade, San Leandro, Florida",2004-05-29 02:07:28,Pasquale,Cooper
1,"738 Opalo Circle, Brooklyn Center, Kansas",2008-04-24 19:42:11,Giuseppe,Wood
2,"747 Desmond Nene, Olive Branch, Wisconsin",2013-08-23 09:41:48,Lindsey,Garza
3,"171 Byron Street, Pleasanton, Vermont",2010-06-21 22:52:23,Randy,Mcpherson
4,"55 Crestwell Square, Oxford, Alaska",2014-12-13 09:47:34,Cristobal,Walsh

In [27]:
# Split the column into 3 new columns
data_frame[['street', 'city','state']] = data_frame.address.str.split(pat = ", ", expand=True)
data_frame

,address,creation_date_time,first_name,last_name,street,city,state
0,"1268 Burgoyne Promenade, San Leandro, Florida",2004-05-29 02:07:28,Pasquale,Cooper,1268 Burgoyne Promenade,San Leandro,Florida
1,"738 Opalo Circle, Brooklyn Center, Kansas",2008-04-24 19:42:11,Giuseppe,Wood,738 Opalo Circle,Brooklyn Center,Kansas
2,"747 Desmond Nene, Olive Branch, Wisconsin",2013-08-23 09:41:48,Lindsey,Garza,747 Desmond Nene,Olive Branch,Wisconsin
3,"171 Byron Street, Pleasanton, Vermont",2010-06-21 22:52:23,Randy,Mcpherson,171 Byron Street,Pleasanton,Vermont
4,"55 Crestwell Square, Oxford, Alaska",2014-12-13 09:47:34,Cristobal,Walsh,55 Crestwell Square,Oxford,Alaska

In [29]:
# Delete the column
data_frame.drop('address', axis=1, inplace=True)
data_frame

,creation_date_time,first_name,last_name,street,city,state
0,2004-05-29 02:07:28,Pasquale,Cooper,1268 Burgoyne Promenade,San Leandro,Florida
1,2008-04-24 19:42:11,Giuseppe,Wood,738 Opalo Circle,Brooklyn Center,Kansas
2,2013-08-23 09:41:48,Lindsey,Garza,747 Desmond Nene,Olive Branch,Wisconsin
3,2010-06-21 22:52:23,Randy,Mcpherson,171 Byron Street,Pleasanton,Vermont
4,2014-12-13 09:47:34,Cristobal,Walsh,55 Crestwell Square,Oxford,Alaska

In [37]:
# Converting the column into datetime
data_frame['creation_date_time'] = pd.to_datetime(data_frame['creation_date_time'], format='%Y-%m-%d %H:%M:%S')
data_frame['creation_date_time']

0   2004-05-29 02:07:28
1   2008-04-24 19:42:11
2   2013-08-23 09:41:48
3   2010-06-21 22:52:23
4   2014-12-13 09:47:34
Name: creation_date_time, dtype: datetime64[ns]

In [40]:
# Create date and time columns from datetime
data_frame['creation_date'] = data_frame.creation_date_time.dt.date
data_frame['creation_time'] = data_frame.creation_date_time.dt.time
data_frame

,creation_date_time,first_name,last_name,street,city,state,creation_date,creation_time
0,2004-05-29 02:07:28,Pasquale,Cooper,1268 Burgoyne Promenade,San Leandro,Florida,2004-05-29,02:07:28
1,2008-04-24 19:42:11,Giuseppe,Wood,738 Opalo Circle,Brooklyn Center,Kansas,2008-04-24,19:42:11
2,2013-08-23 09:41:48,Lindsey,Garza,747 Desmond Nene,Olive Branch,Wisconsin,2013-08-23,09:41:48
3,2010-06-21 22:52:23,Randy,Mcpherson,171 Byron Street,Pleasanton,Vermont,2010-06-21,22:52:23
4,2014-12-13 09:47:34,Cristobal,Walsh,55 Crestwell Square,Oxford,Alaska,2014-12-13,09:47:34

In [41]:
# Delete the column
data_frame.drop('creation_date_time', axis=1, inplace=True)
data_frame

,first_name,last_name,street,city,state,creation_date,creation_time
0,Pasquale,Cooper,1268 Burgoyne Promenade,San Leandro,Florida,2004-05-29,02:07:28
1,Giuseppe,Wood,738 Opalo Circle,Brooklyn Center,Kansas,2008-04-24,19:42:11
2,Lindsey,Garza,747 Desmond Nene,Olive Branch,Wisconsin,2013-08-23,09:41:48
3,Randy,Mcpherson,171 Byron Street,Pleasanton,Vermont,2010-06-21,22:52:23
4,Cristobal,Walsh,55 Crestwell Square,Oxford,Alaska,2014-12-13,09:47:34

In [48]:
# Defining columns
column_names = ['id', 'city', 'state', 'city', 'state']

# Defining lists
row1 = list([1,'Hutchinson', 'Texas', 'Hutchinson', 'Texas'])
row2 = list([2,'Yorkville', 'South Dakota', 'Yorkville', 'South Dakota'])
row3 = list([1,'Hutchinson', 'Texas', 'Hutchinson', 'Texas'])
row4 = list([3,'Round Lake', 'Kansas', 'Round Lake', 'Kansas'])
row5 = list([4,'Orinda', 'Montana', 'Orinda', 'Montana'])
row6 = list([3,'Round Lake', 'Kansas', 'Round Lake', 'Kansas'])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5, row6], columns=column_names)

# Display DataFrame values
data_frame

   id        city         state        city         state
0   1  Hutchinson         Texas  Hutchinson         Texas
1   2   Yorkville  South Dakota   Yorkville  South Dakota
2   1  Hutchinson         Texas  Hutchinson         Texas
3   3  Round Lake        Kansas  Round Lake        Kansas
4   4      Orinda       Montana      Orinda       Montana
5   3  Round Lake        Kansas  Round Lake        Kansas

In [51]:
# Check if columns are duplicates
data_frame.columns.duplicated()

array([False, False, False,  True,  True])

In [54]:
# Select only the non duplicate columns
data_frame = data_frame.drop_duplicates()
data_frame

/Users/williamso/.local/share/virtualenvs/git-2T0aQk80/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   id        city         state
0   1  Hutchinson         Texas
1   2   Yorkville  South Dakota
3   3  Round Lake        Kansas
4   4      Orinda       Montana

In [55]:
# Remove row duplicates
data_frame = data_frame.drop_duplicates()
data_frame

   id        city         state
0   1  Hutchinson         Texas
1   2   Yorkville  South Dakota
3   3  Round Lake        Kansas
4   4      Orinda       Montana

In [46]:
def create_rows_mimesis(num=1):
    output = [{"city":addess.city(),
                   "state":addess.state()
              } for x in range(num)
             ]
    return output

df_mimesis = pd.DataFrame(create_rows_mimesis(10))
df_mimesis

              city          state
0       Hutchinson          Texas
1       Farmington     New Mexico
2  West Palm Beach  New Hampshire
3           Mobile   North Dakota
4           Nashua  Massachusetts
5     Laguna Woods   North Dakota
6       Round Lake         Kansas
7           Lenexa      Minnesota
8           Orinda        Montana
9        Yorkville   South Dakota

In [72]:
# Defining columns
column_names = ['YEAR', 'M0-24', 'M25-54', 'M55', 'F0-24', 'F25-54', 'F55']
 
# Defining lists
row1 = list([2018, 282, 812, 993, 712, 466, 373])
row2 = list([2019, 243,196,365,340,969,659])
 
# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2], columns=column_names)
 
# Display DataFrame values
data_frame

   YEAR  M0-24  M25-54  M55  F0-24  F25-54  F55
0  2018    282     812  993    712     466  373
1  2019    243     196  365    340     969  659

In [73]:
# Move the demographics columns into rows
data_frame = data_frame.melt(id_vars=["YEAR"],var_name=["demographic"],value_name="sales")
data_frame

    YEAR demographic  sales
0   2018       M0-24    282
1   2019       M0-24    243
2   2018      M25-54    812
3   2019      M25-54    196
4   2018         M55    993
5   2019         M55    365
6   2018       F0-24    712
7   2019       F0-24    340
8   2018      F25-54    466
9   2019      F25-54    969
10  2018         F55    373
11  2019         F55    659

In [74]:
# Split the column into new columns
data_frame['gender'] = data_frame.demographic.str[0].astype(str)
data_frame['age_group'] = data_frame.demographic.str[1:].astype(str)
data_frame

    YEAR demographic  sales gender age_group
0   2018       M0-24    282      M      0-24
1   2019       M0-24    243      M      0-24
2   2018      M25-54    812      M     25-54
3   2019      M25-54    196      M     25-54
4   2018         M55    993      M        55
5   2019         M55    365      M        55
6   2018       F0-24    712      F      0-24
7   2019       F0-24    340      F      0-24
8   2018      F25-54    466      F     25-54
9   2019      F25-54    969      F     25-54
10  2018         F55    373      F        55
11  2019         F55    659      F        55

In [75]:
# Delete the column
data_frame.drop('demographic', axis=1, inplace=True)
data_frame

    YEAR  sales gender age_group
0   2018    282      M      0-24
1   2019    243      M      0-24
2   2018    812      M     25-54
3   2019    196      M     25-54
4   2018    993      M        55
5   2019    365      M        55
6   2018    712      F      0-24
7   2019    340      F      0-24
8   2018    466      F     25-54
9   2019    969      F     25-54
10  2018    373      F        55
11  2019    659      F        55

In [78]:
# Defining lists
row1 = list([1, 282])
row2 = list([2, 243])
row3 = list([3, 391])
row4 = list([4, 973])

# Defining a DataFrame
data_frame_2018 = pd.DataFrame(data=[row1, row2, row3, row4], columns=['store_id', 'sales'])
 
# Display DataFrame values
data_frame_2018

   store_id  sales
0         1    282
1         2    243
2         3    391
3         4    973

In [79]:
# Defining lists
row5 = list([1, 272])
row6 = list([2, 370])
row7 = list([3, 178])
row8 = list([4, 622])

# Defining a DataFrame
data_frame_2019 = pd.DataFrame(data=[row5, row6, row7, row8], columns=['store_id', 'sales'])
 
# Display DataFrame values
data_frame_2019

   store_id  sales
0         1    272
1         2    370
2         3    178
3         4    622

In [80]:
# Creating a column for the year
data_frame_2018["year"]="2018"
data_frame_2018

   store_id  sales  year
0         1    282  2018
1         2    243  2018
2         3    391  2018
3         4    973  2018

In [81]:
# Creating a column for the year
data_frame_2019["year"]="2019"
data_frame_2019

   store_id  sales  year
0         1    272  2019
1         2    370  2019
2         3    178  2019
3         4    622  2019

In [91]:
# Concatenating the dataframe
data_frame = pd.concat([data_frame_2018, data_frame_2019])
data_frame

   store_id  sales  year
0         1    282  2018
1         2    243  2018
2         3    391  2018
3         4    973  2018
0         1    272  2019
1         2    370  2019
2         3    178  2019
3         4    622  2019

In [92]:
# Sorting the dataframe
data_frame = data_frame.sort_values(by=['store_id', 'year'])
data_frame

   store_id  sales  year
0         1    282  2018
0         1    272  2019
1         2    243  2018
1         2    370  2019
2         3    391  2018
2         3    178  2019
3         4    973  2018
3         4    622  2019

In [93]:
# Resetting the dataframe's index
data_frame = data_frame.reset_index(drop = True)
data_frame

   store_id  sales  year
0         1    282  2018
1         1    272  2019
2         2    243  2018
3         2    370  2019
4         3    391  2018
5         3    178  2019
6         4    973  2018
7         4    622  2019

In [105]:
# Defining columns
column_names = ['id', 'city', 'state', 'population']

# Defining lists
row1 = list([1,'Hutchinson', 'Texas', 20938])
row2 = list([None ,'Yorkville', 'Illinois', 20119])
row3 = list([3,'Round Lake', 'Illinois', None])
row4 = list([4,'Orinda', None, 19926])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4], columns=column_names)

# Display DataFrame values
data_frame

    id        city     state  population
0  1.0  Hutchinson     Texas     20938.0
1  NaN   Yorkville  Illinois     20119.0
2  3.0  Round Lake  Illinois         NaN
3  4.0      Orinda      None     19926.0

In [109]:
# Select rows with missing data
data_frame[data_frame.isnull().any(1)]

    id        city     state  population
1  NaN   Yorkville  Illinois     20119.0
2  3.0  Round Lake  Illinois         NaN
3  4.0      Orinda      None     19926.0

In [110]:
# Drop any rows with missing data
data_frame.dropna()

    id        city  state  population
0  1.0  Hutchinson  Texas     20938.0

In [114]:
# Filling missing values
data_frame['state'] = data_frame.state.fillna('Missing Value')
data_frame

    id        city          state  population
0  1.0  Hutchinson          Texas     20938.0
1  NaN   Yorkville       Illinois     20119.0
2  3.0  Round Lake       Illinois         NaN
3  4.0      Orinda  Missing Value     19926.0

In [115]:
# Filling missing values
data_frame['id'] = data_frame.id.fillna(-999)
data_frame

      id        city          state  population
0    1.0  Hutchinson          Texas     20938.0
1 -999.0   Yorkville       Illinois     20119.0
2    3.0  Round Lake       Illinois         NaN
3    4.0      Orinda  Missing Value     19926.0

In [116]:
# Filling missing values
data_frame['population'] = data_frame.id.fillna(-999)
data_frame

      id        city          state  population
0    1.0  Hutchinson          Texas         1.0
1 -999.0   Yorkville       Illinois      -999.0
2    3.0  Round Lake       Illinois         3.0
3    4.0      Orinda  Missing Value         4.0

In [117]:
# Defining columns
column_names = ['store_id', 'sales', 'year']

# Defining lists
row1 = list([1,282, 2018])
row2 = list([1,272, 2019])
row3 = list([2,243, 2018])
row4 = list([2,370, 2019])
row5 = list([3,391, 2018])
row6 = list([3,178, 2019])
row7 = list([4,973, 2018])
row8 = list([4,622, 2019])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5, row6, row7, row8], columns=column_names)

# Display DataFrame values
data_frame

   store_id  sales  year
0         1    282  2018
1         1    272  2019
2         2    243  2018
3         2    370  2019
4         3    391  2018
5         3    178  2019
6         4    973  2018
7         4    622  2019

In [133]:
# Grouping the data
grouped = data_frame.groupby('store_id')[['sales']]
grouped

In [135]:
# Sum aggregation
grouped.sum()

          sales
store_id
1           554
2           613
3           569
4          1595

In [136]:
# Average aggregation
grouped.mean()

          sales
store_id
1         277.0
2         306.5
3         284.5
4         797.5

In [137]:
# Min aggregation
grouped.min()

          sales
store_id
1           272
2           243
3           178
4           622

In [138]:
# Max aggregation
grouped.max()

          sales
store_id
1           282
2           370
3           391
4           973

In [139]:
# Standard deviation aggregation
grouped.std()

               sales
store_id
1           7.071068
2          89.802561
3         150.613744
4         248.194480

In [141]:
# Variance aggregation
grouped.var()

            sales
store_id
1            50.0
2          8064.5
3         22684.5
4         61600.5

In [140]:
# Describe aggregation
grouped.describe()

         sales
         count   mean         std    min     25%    50%     75%    max
store_id
1          2.0  277.0    7.071068  272.0  274.50  277.0  279.50  282.0
2          2.0  306.5   89.802561  243.0  274.75  306.5  338.25  370.0
3          2.0  284.5  150.613744  178.0  231.25  284.5  337.75  391.0
4          2.0  797.5  248.194480  622.0  709.75  797.5  885.25  973.0

In [148]:
# List of aggregations
grouped.agg(['sum', 'mean','min', 'max', 'std'])

         sales
           sum   mean  min  max         std
store_id
1          554  277.0  272  282    7.071068
2          613  306.5  243  370   89.802561
3          569  284.5  178  391  150.613744
4         1595  797.5  622  973  248.194480

In [4]:
# Defining lists
row1 = list(['Pandas', 'Product A', 476, 46, 2010])
row2 = list(['Pandas', 'Product B', 794, 39, 2010])
row3 = list(['Pandas', 'Product C', 199, 62, 2010])
row4 = list(['Pandas', 'Product A', 686, 26, 2011])
row5 = list(['Pandas', 'Product B', 207, 93, 2011])
row6 = list(['Pandas', 'Product C', 199, 62, 2011])
row7 = list(['Python', 'Product A', 300, 33, 2010])
row8 = list(['Python', 'Product B', 949, 51, 2010])
row9 = list(['Python', 'Product C', 168, 30, 2010])
row10 = list(['Python', 'Product A', 921, 51, 2011])
row11 = list(['Python', 'Product B', 266, 24, 2011])
row12 = list(['Python', 'Product C', 674, 39, 2011])

# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4, row5, row6, row7, row8, row9, row10, row11, row12], columns=['brand', 'type', 'sales', 'units', 'year'])

# Display DataFrame values
data_frame

     brand       type  sales  units  year
0   Pandas  Product A    476     46  2010
1   Pandas  Product B    794     39  2010
2   Pandas  Product C    199     62  2010
3   Pandas  Product A    686     26  2011
4   Pandas  Product B    207     93  2011
5   Pandas  Product C    199     62  2011
6   Python  Product A    300     33  2010
7   Python  Product B    949     51  2010
8   Python  Product C    168     30  2010
9   Python  Product A    921     51  2011
10  Python  Product B    266     24  2011
11  Python  Product C    674     39  2011

In [16]:
# Pivot table average sales by brand
pd.pivot_table(data_frame, index = 'brand', values = 'sales')

             sales
brand
Pandas  426.833333
Python  546.333333

In [19]:
# Pivot table total, min and max sales by brand
pd.pivot_table(data_frame, index = 'brand', values = 'sales', aggfunc = ['sum', 'min', 'max'])

         sum   min   max
       sales sales sales
brand
Pandas  2561   199   794
Python  3278   168   949

In [21]:
# Pivot table total, min and max sales and unites by brand
pd.pivot_table(data_frame, index = ['brand'], values = ['sales','units'], aggfunc = ['sum', 'min', 'max'])

         sum         min         max
       sales units sales units sales units
brand
Pandas  2561   328   199    26   794    93
Python  3278   228   168    24   949    51

In [23]:
# Pivot table total, min and max sales and unites by type and brand
pd.pivot_table(data_frame, index = ['type','brand'], values = ['sales','units'], aggfunc = ['sum', 'min', 'max'])

                   sum         min         max
                 sales units sales units sales units
type      brand
Product A Pandas  1162    72   476    26   686    46
          Python  1221    84   300    33   921    51
Product B Pandas  1001   132   207    39   794    93
          Python  1215    75   266    24   949    51
Product C Pandas   398   124   199    62   199    62
          Python   842    69   168    30   674    39

In [24]:
# Pivot table total, min and max sales and unites by type and brand
pd.pivot_table(data_frame, index = ['brand','type'], values = ['sales','units'], aggfunc = ['sum', 'min', 'max'])

                   sum         min         max
                 sales units sales units sales units
brand  type
Pandas Product A  1162    72   476    26   686    46
       Product B  1001   132   207    39   794    93
       Product C   398   124   199    62   199    62
Python Product A  1221    84   300    33   921    51
       Product B  1215    75   266    24   949    51
       Product C   842    69   168    30   674    39

In [27]:
# Pivot table total, min and max sales and unites by type and brand
pd.pivot_table(data_frame, index = ['brand','type'], values = ['sales','units'], aggfunc = ['sum', 'min', 'max'], margins = True, margins_name='Total')

                   sum         min         max
                 sales units sales units sales units
brand  type
Pandas Product A  1162    72   476    26   686    46
       Product B  1001   132   207    39   794    93
       Product C   398   124   199    62   199    62
Python Product A  1221    84   300    33   921    51
       Product B  1215    75   266    24   949    51
       Product C   842    69   168    30   674    39
Total             5839   556   168    24   949    93

In [30]:
# Defining columns
column_names = ['id', 'city', 'state', 'population']

# Defining lists
row1 = list([1,'Hutchinson', 'Texas', 20938])
row2 = list([None ,'Yorkville', 'Illinois', 20119])
row3 = list([3,'Round Lake', 'Illinois', None])
row4 = list([4,'Orinda', 'California', 19926])
 
# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2, row3, row4], columns=column_names)

# Display DataFrame values
data_frame

    id        city       state  population
0  1.0  Hutchinson       Texas     20938.0
1  NaN   Yorkville    Illinois     20119.0
2  3.0  Round Lake    Illinois         NaN
3  4.0      Orinda  California     19926.0

In [31]:
data_frame.dropna()

    id        city       state  population
0  1.0  Hutchinson       Texas     20938.0
3  4.0      Orinda  California     19926.0

In [32]:
data_frame

    id        city       state  population
0  1.0  Hutchinson       Texas     20938.0
1  NaN   Yorkville    Illinois     20119.0
2  3.0  Round Lake    Illinois         NaN
3  4.0      Orinda  California     19926.0

In [36]:
data_frame[~data_frame['population'].isnull()]

    id        city       state  population
0  1.0  Hutchinson       Texas     20938.0
1  NaN   Yorkville    Illinois     20119.0
3  4.0      Orinda  California     19926.0

In [37]:
data_frame.dropna(axis = 1)

         city       state
0  Hutchinson       Texas
1   Yorkville    Illinois
2  Round Lake    Illinois
3      Orinda  California

In [39]:
from mimesis import Person
from mimesis import Address
from mimesis.enums import Gender
from mimesis import Datetime
person = Person('en')
import pandas as pd
import random
person = Person()
addess = Address()
datetime = Datetime()
def create_rows_mimesis(num=1):
    output = [{"full_name":person.full_name(),
                   "address":addess.address() + ', '+ addess.city() + ', '+ addess.state()
                   #"name":person.name() + ' ' + person.name(),
                   #"email":person.email(),
                   #"creation_date_time":datetime.datetime()
                   #"paragraph":person.paragraph(),
                   #"Conrad":person.catch_phrase(),
                   #"randomdata":random.randint(1000,2000)
              } for x in range(num)
             ]
    return output

df_mimesis = pd.DataFrame(create_rows_mimesis(50))
df_mimesis

              full_name                                            address
0        Vernia Anthony             1051 Balceta Square, Reedley, Michigan
1       Daren Underwood        982 Duboce Gardens, Peachtree City, Georgia
2         Stanley Marks     541 Merrill Stravenue, Talladega, Pennsylvania
3             Shad Ruiz        1018 Whiting Line, North Platte, New Jersey
4          Danny Mooney       1301 Grand View Crescent, Oviedo, Washington
5         Jacqui Barron                  272 Boardman Row, Manteca, Hawaii
6          Elijah Casey               387 Hubbell Green, Springfield, Utah
7            Jutta Gill              632 Tulip Plaza, Newport Beach, Maine
8            Riva Foley            497 Coleridge Route, Schererville, Iowa
9         Jutta Woodard                129 Ora Point, Wheat Ridge, Alabama
10         Fleta Walton             1026 Brook Gardens, Murrieta, Colorado
11      Stanley Calhoun           804 Glover Crescent, Chattanooga, Hawaii
12          Dimple Head  1338 Halyburton Thruway, Bentonville, Massachu...
13       Rossana Horton             1269 Hunt Pike, Dania Beach, Wisconsin
14      Jeffrey Collier        544 Havens Walk, Indianapolis, Rhode Island
15         Stephan Bray                698 Ina Annex, Ridgecrest, Kentucky
16      Aleen Whitfield           1159 Ohlone Line, South Euclid, Missouri
17     Arlie Fitzgerald    1030 Elgin Private, Huber Heights, North Dakota
18        Darrin Mathis                   218 Graham Private, Chino, Idaho
19          Lane Mooney               1195 Saint Croix Cove, Irving, Texas
20  Christoper Stephens               873 Standish Mall, Belle Glade, Iowa
21         Alden Clarke        849 Loma Vista Route, Sherman, North Dakota
22           Fred Olson          1180 Farview Expressway, Dalton, Kentucky
23        August Phelps               602 Cuba Wynd, Ontario, Pennsylvania
24      Perry Dickerson               920 Shields Glen, Southaven, Alabama
25      Elvin Mccormick               146 Taylor Townline, Ankeny, Georgia
26      Glennis Ballard     863 Geary Side road, Saratoga Springs, Alabama
27            Bulah Fry       286 Page Field, Pompano Beach, Massachusetts
28           Moshe Koch           1037 Storey Terrace, Wauwatosa, Oklahoma
29       Jonelle Newman      384 Samoset Concession road, Hickory, Florida
30         Wyatt Spears             113 Escondido Mall, Skokie, California
31       Lawerence Hays  1341 Fairbanks Expressway, Monroeville, West V...
32      Maurice Burnett     484 Candlestick Cove Drung, Converse, Oklahoma
33       Aleshia Morton    850 Lagunitas Mews, Beverly Hills, North Dakota
34     Logan Stephenson          705 Barry Plaza, Madison Heights, Vermont
35           Rob Grimes         1126 Battery Field, Laramie, New Hampshire
36     Dominica Spencer                 351 Hicks Path, Stockton, Colorado
37       Kera Underwood           551 Divisadero Street, Claremont, Hawaii
38          Kallie Love          233 Calgary Spur, Gresham, North Carolina
39        Jimmie Mooney      209 Lake Forest Expressway, Brawley, Arkansas
40     Josef Stephenson                 770 Roselyn Path, Coronado, Nevada
41            Amos Page        537 Ortega Concession road, Pelham, Alabama
42         Weldon Rocha  1090 Transbay Loop Street, North Chicago, Arizona
43       Raul Wilkinson                  638 Marlin Point, Macon, Michigan
44         Eugene Rocha                   1394 Sawyer Road, Geneva, Hawaii
45      Augustus Conley      421 Powhattan Sideline, Caldwell, Mississippi
46      Lyndia Humphrey          323 Lori Plantation, Vernon Hills, Oregon
47         Vito Cochran  136 Dr Tom Waddell Bypass, Pembroke Pines, New...
48      Preston Randall         1178 Burke Boulevard, Sugar Land, Oklahoma
49       Derrick Holman             401 Cayuga Viaduct, Pittsburg, Indiana

In [40]:
df_mimesis.to_csv('test')

In [41]:
# Defining columns
column_names = ['YEAR', 'M0-24', 'M25-54', 'M55', 'F0-24', 'F25-54', 'F55']
 
# Defining lists
row1 = list([2018, 282, 812, 993, 712, 466, 373])
row2 = list([2019, 243,196,365,340,969,659])
 
# Defining a DataFrame
data_frame = pd.DataFrame(data=[row1, row2], columns=column_names)
 
# Display DataFrame values
data_frame

   YEAR  M0-24  M25-54  M55  F0-24  F25-54  F55
0  2018    282     812  993    712     466  373
1  2019    243     196  365    340     969  659